# ShellComponentCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangulatedSolidOrShell..::..ShellComponentCount Property
TriangulatedSolidOrShell Class See Also
---
The number of TriangulatedShellComponents that this TriangulatedSolidOrShell contains.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int ShellComponentCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ShellComponentCount As Integer
	Get
```

Visual C++
---
```text
public:
property int ShellComponentCount {
	int get ();
}
```

# See Also
TriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace